AccumulationRegisters/ОборотыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоКатегориям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИтогиПланаМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИтогиПланаМесяца</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланКатегории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланАктивы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактКатегорииНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактАктивыНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактВалютыНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нераспределено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПланБюджетаМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланБюджетаМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИтогиПланаМесяца</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МесяцПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательныеТратыИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноКПланированию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нераспределено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбязательныеТраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланПоКатегориям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРаспределенияБюджета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипРаспределенияБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Активы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипРаспределенияБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ТгБотОтчеты/Ext/Module.bsl
// Возвращает отформатированный текст с курсами валют ЦБ РФ для публикации в Telegram
 //
 // Возвращаемое значение:
 //   Строка - текст с курсами валют в формате Markdown или сообщение об ошибке
 Функция  ПолучитьТекстКурсаДляТг() Экспорт
	
	ВсеКурсы = ВыгрузкаИзЦБКурса.ПолучитьКурсВалют(ТекущаяДата());
	
	Если ВсеКурсы = Неопределено или Всекурсы.Количество() = 0 Тогда
		Возврат "Не удалось сделать выгрузку из ЦБ, попробуйте ещё раз или обратитесь к админу";
	КонецЕсли;
	
	Текст = "*Курс Валют ЦБ на" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + "*" + Символы.ПС;
	Текст = Текст + "---------------------------" + Символы.ПС;
	
	НужныеВалюты = "USD,EUR,CNY,BYN";
	
	МассивКодов = СтрРазделить(НужныеВалюты, ",");
	
	Для Каждого Код из МассивКодов Цикл
		Курс=ВсеКурсы.Получить(Код);
		Если Курс <> Неопределено Тогда
			 Текст = Текст + " *" + Код + "*: " + Формат(Курс, "ЧДЦ=2; ЧРД=.") + " руб." + Символы.ПС;
		 КонецЕсли;
	 КонецЦикла;
	 
	 Текст = Текст + "---------------------------" + Символы.ПС;
    Текст = Текст + "_Обновлено автоматически_ ";
    
    Возврат Текст;
		
КонецФункции  
// Формирует отчет по категориям с планом и фактом за текущий месяц для пользователя Telegram.
//
// Параметры:
//   ЧатID - Число - идентификатор чата пользователя в Telegram
//
// Возвращаемое значение:
//   Строка - текст отчета с данными по категориям в формате Telegram
Функция СформироватьОтчётКатегорийИтоги(ЧатID) Экспорт
	
	ТекПользователь = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ

	|	ВЫБОР КОГДА ТЧ.Категория.ЭтоГруппа ТОГДА ТЧ.Категория ИНАЧЕ ТЧ.Категория.Родитель КОНЕЦ КАК Категория,
	|	СУММА(ТЧ.Сумма) КАК План
	|ПОМЕСТИТЬ ВТ_План

	|ИЗ
	|	Документ.ПланБюджетаМесяца.ПланПоКатегориям КАК ТЧ
	|ГДЕ

	|	ТЧ.Ссылка.Проведен И ТЧ.Ссылка.Пользователь = &Пользователь
	|	И НАЧАЛОПЕРИОДА(ТЧ.Ссылка.МесяцПлана, МЕСЯЦ) = &Месяц
	|СГРУППИРОВАТЬ ПО

	|	ВЫБОР КОГДА ТЧ.Категория.ЭтоГруппа ТОГДА ТЧ.Категория ИНАЧЕ ТЧ.Категория.Родитель КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Рег.Категория.ЭтоГруппа ТОГДА Рег.Категория ИНАЧЕ Рег.Категория.Родитель КОНЕЦ КАК Категория,
	|	СУММА(Рег.СуммаОборот) КАК Факт

	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.ОборотыПоКатегориям.Обороты(НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ), КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ), , Пользователь = &Пользователь) КАК Рег

	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Рег.Категория.ЭтоГруппа ТОГДА Рег.Категория ИНАЧЕ Рег.Категория.Родитель КОНЕЦ
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_План.Категория, ВТ_Факт.Категория) КАК Категория,

	|	ЕСТЬNULL(ВТ_План.План, 0) КАК План,
	|	ЕСТЬNULL(ВТ_Факт.Факт, 0) КАК Факт
	|ИЗ

	|	ВТ_План КАК ВТ_План
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Факт КАК ВТ_Факт
	|		ПО ВТ_План.Категория = ВТ_Факт.Категория";

	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ТекущаяДата()));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Текст = "*ДЕТАЛЬНЫЙ ОТЧЕТ ПО КАТЕГОРИЯМ*" + Символы.ПС + "---------------------------" + Символы.ПС + Символы.ПС;
	
	Пока Выборка.Следующий() Цикл
		ИмяКат = ?(ЗначениеЗаполнено(Выборка.Категория), Выборка.Категория.Наименование, "Без категории");
		Текст = Текст + СформироватьСтрокуПрогрессаКатегории(ИмяКат, Выборка.Факт, Выборка.План);
	КонецЦикла;
                                                 
	Возврат Текст;
КонецФункции
// Формирует строку с визуальным индикатором прогресса и статистикой по категории
//
// Параметры:
//   Заголовок - Строка - заголовок категории
//   Факт - Число - фактическое значение (отрицательное для инверсии знака)
//   План - Число - плановое значение
//
// Возвращаемое значение:
//   Строка - форматированная строка с индикатором выполнения и значениями
Функция СформироватьСтрокуПрогрессаКатегории(Заголовок, Факт, План)
	Процент = ?(План > 0, (-(Факт) / План) * 100, 0);
	Заполнено = Мин(Цел(Процент / 10), 10);
	Пусто = Макс(10 - Заполнено, 0);
	
	Индикатор = "[";
	Для Счетчик = 1 По Заполнено Цикл
		Индикатор = Индикатор + "■"; 
	КонецЦикла;
	Для Счетчик = 1 По Пусто Цикл
		Индикатор = Индикатор + "▫";
	КонецЦикла;
	Индикатор = Индикатор + "]";
	
	Результат = "*" + Заголовок + "* (" + Формат(Процент, "ЧЦ=3; ЧДЦ=0") + "%)" + Символы.ПС +
	            Индикатор + Символы.ПС +
	            "Ф: " + Формат(-(Факт), "ЧЦ=15; ЧДЦ=0") + " / П: " + Формат(План, "ЧЦ=15; ЧДЦ=0") + " р." + Символы.ПС + Символы.ПС;
	
	Возврат Результат;
КонецФункции
// Формирует текстовый отчет о прогрессе выполнения финансового плана за текущий месяц
//
// Параметры:
//   ЧатID - Строка - идентификатор чата пользователя
//
// Возвращаемое значение:
//   Строка - текст отчета с прогрессом по категориям, активам и валютам
//   - Строка - сообщение об отсутствии данных бюджета
Функция СформироватьОтчетИзРегистраИтоги(ЧатID) Экспорт
	ТекПользователь = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ

	|	Итоги.ПланКатегории,
	|	Итоги.ФактКатегорииНаДату КАК ФактКатегории,
	|	Итоги.ПланАктивы,

	|	Итоги.ФактАктивыНаДату КАК ФактАктивы,
	|	Итоги.ПланВалюты,
	|	Итоги.ФактВалютыНаДату КАК ФактВалюты

	|ИЗ
	|	РегистрСведений.ИтогиПланаМесяца КАК Итоги
	|ГДЕ

	|	Итоги.Пользователь = &Пользователь
	|	И Итоги.Месяц = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Текст = " *Ваш финансовый план на " + Формат(ТекущаяДата(), "ДФ='MMMM'") + "*" + Символы.ПС + Символы.ПС;
		
		// Обрабатываем три блока: Категории, Активы, Валюты
		Текст = Текст + СформироватьСтрокуПрогресса(" Категории", Выборка.ФактКатегории, Выборка.ПланКатегории);
		Текст = Текст + СформироватьСтрокуПрогресса(" Активы", Выборка.ФактАктивы, Выборка.ПланАктивы);
		Текст = Текст + СформироватьСтрокуПрогресса(" Валюты", Выборка.ФактВалюты, Выборка.ПланВалюты);
		
		Возврат Текст;
	Иначе
		Возврат "❌ Данные по бюджету на текущий месяц не найдены.";
	КонецЕсли;
	
КонецФункции
// Формирует строку с визуальным индикатором выполнения задачи и детальной информацией о прогрессе
//
// Параметры:
//   Заголовок - Строка - заголовок задачи или процесса
//   Факт - Число - фактически выполненный объем
//   План - Число - плановый объем
//
// Возвращаемое значение:
//   Строка - отформатированная строка с индикатором прогресса и значениями факта/плана
Функция СформироватьСтрокуПрогресса(Заголовок, Факт, План)
	
	Процент = ?(План > 0, (Факт / План) * 100, 0);
	
	Заполнено = Мин(Цел(Процент / 10), 10);
	Пусто     = Макс(10 - Заполнено, 0);
	Индикатор = "["; 
	Для Счетчик = 1 По Заполнено Цикл
		Индикатор = Индикатор + "■"; 
	КонецЦикла;
	Для Счетчик = 1 По Пусто Цикл
		Индикатор = Индикатор + "▫"; 
	КонецЦикла;
	Индикатор = Индикатор + "]";
	
	Результат = "*" + Заголовок + "* (" + Формат(Процент, "ЧЦ=3; ЧДЦ=0") + "%)" + Символы.ПС +
	            Индикатор + Символы.ПС +
	            "Факт: " + Формат(Факт, "ЧЦ=15; ЧДЦ=0") + " / План: " + Формат(План, "ЧЦ=15; ЧДЦ=0") + " руб." + Символы.ПС + Символы.ПС;
	
	Возврат Результат;
	
КонецФункции
// Формирует текстовый прогноз темпа расходов пользователя на основе фактических трат и плана на месяц.
//
// Параметры:
//   ЧатID - <Тип> - идентификатор чата в Telegram для определения пользователя
//
// Возвращаемое значение:
//   Строка - текстовый отчет с прогнозом и рекомендациями
//   - Строка - сообщение об отсутствии данных или заданного плана
Функция СформироватьПрогнозТемпа(ЧатID) Экспорт
	
	ТекПользователь = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ

	|	Итоги.ПланКатегории КАК План,
	|	Итоги.ФактКатегорииНаДату КАК Факт
	|ИЗ

	|	РегистрСведений.ИтогиПланаМесяца КАК Итоги
	|ГДЕ
	|	Итоги.Пользователь = &Пользователь
	|	И Итоги.Месяц = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		План = ?(Выборка.План = NULL, 0, Выборка.План);
		Факт = БюджетПланированиеСервер.ПолучитьФактКатегорииНаДату(ТекПользователь,ТекущаяДата(), ТекущаяДата());
		
		Если План = 0 Тогда Возврат "(!) План на месяц не задан, прогноз невозможен."; КонецЕсли;

		ТекДата = ТекущаяДата();
		ВсегоДнейВМесяце = День(КонецМесяца(ТекДата));
		ПрошлоДней = День(ТекДата);
		
		ДоляВремени = (ПрошлоДней / ВсегоДнейВМесяце) * 100;
		ДоляТрат    = (Факт / План) * 100;
		
		// 3. Прогноз
		СреднийРасходВДень = Факт / ПрошлоДней;
		ПрогнозНаКонецМесяца = СреднийРасходВДень * ВсегоДнейВМесяце;
		РазницаСПланом = ПрогнозНаКонецМесяца - План;
		
		// 4. Формируем текст
		Текст = "* АНАЛИЗ ТЕМПА ТРАТ *" + Символы.ПС + "---------------------------" + Символы.ПС;
		
		// Полоска времени
		Текст = Текст + "--- ВРЕМЯ: " + Формат(ДоляВремени, "ЧЦ=3; ЧДЦ=0") + "% месяца прошло" + Символы.ПС;
		Текст = Текст + РисоватьПолоску_Текст(ДоляВремени) + Символы.ПС;
		
		// Полоска денег
		Текст = Текст + "--- ТРАТЫ: " + Формат(ДоляТрат, "ЧЦ=3; ЧДЦ=0") + "% лимита съедено" + Символы.ПС;
		Текст = Текст + РисоватьПолоску_Текст(ДоляТрат) + Символы.ПС + Символы.ПС;
		
		// Вердикт
		Текст = Текст + "Прогноз к концу месяца: " + Формат(ПрогнозНаКонецМесяца, "ЧЦ=15; ЧДЦ=0") + " р." + Символы.ПС;
		
		Если РазницаСПланом > 0 Тогда
			Текст = Текст + "(!) ОЖИДАЕТСЯ ПЕРЕРАСХОД: *" + Формат(РазницаСПланом, "ЧЦ=15; ЧДЦ=0") + " р.*" + Символы.ПС;
			
			ДнейОсталось = (ВсегоДнейВМесяце - ПрошлоДней + 1);
			ДневнойЛимит = (План - Факт) / ДнейОсталось;
			
			Текст = Текст + "Совет: чтобы уложиться, трать не более *" + Формат(Макс(ДневнойЛимит, 0), "ЧЦ=15; ЧДЦ=0") + " р.* в день.";
		Иначе
			Текст = Текст + "(+) Идешь с экономией: *" + Формат(-РазницаСПланом, "ЧЦ=15; ЧДЦ=0") + " р.*";
		КонецЕсли;
		
		Возврат Текст;
	Иначе
		Возврат "(-) Нет данных для анализа.";
	КонецЕсли;
	
КонецФункции
// Возвращает текстовое представление горизонтальной полосы прогресса на основе заданного процента заполнения.
//
// Параметры:
//   Процент - Число - процент заполнения полосы от 0 до 100
//
// Возвращаемое значение:
//   Строка - строка с символами ■ и ▫, отображающая прогресс в скобках
Функция РисоватьПолоску_Текст(Процент)
	Заполнено = Мин(Цел(Процент / 10), 10);
	Рез = "[";
	Для Счетчик = 1 По Заполнено Цикл
		Рез = Рез + "■"; 
	КонецЦикла;
	Для Счетчик = 1 По (10-Заполнено) Цикл
		Рез = Рез + "▫"; 
	КонецЦикла;
	Возврат Рез + "]";
КонецФункции
